export const ToolTipMap = {
  침잠: "공격 스킬로 피격 시, 효과 위력만큼 고정 정신력 피해를 받음 (정신력이 없는 대상에게는 우울 속성 피해로 적용됨)\n피격 후 횟수 1 감소",
  마비: "한 턴 동안 수치만큼 코인 위력이 0으로 고정",
  화상: "턴 종료 시, 효과 위력만큼 고정 체력 피해를 받음\n턴 종료 후 횟수 1 감소",
  출혈: "공격 스킬의 코인 판정 시, 효과 위력만큼 고정 체력 피해를 받음\n공격 스킬의 코인 판정 후 횟수 1 감소",
  진동: "진동 폭발 스킬로 피격 시, 효과 위력만큼 흐트러짐 손상\n턴 종료 후 횟수 1 감소",
  파열: "공격 스킬로 피격 시, 효과 위력만큼 고정 체력 피해를 받음\n피격 후 횟수 1 감소",
  취약: "한 턴 동안 스킬로 받는 피해가 수치에 비례하여 증가(최대 10)",
  속박: "red",
  못: "red",
  주시: "red",
  갈증: "red",
  침잠쇄도:
    "(침잠 횟수 x 침잠 위력)만큼 정신 피해를 주고, 침잠 제거\n대상의 정신력이 -45 이하면 초과된 정신 피해를 우울 속성 피해로 가함.\n(정신력이 없는 대상에게는 전부 우울 속성 피해로 적용됨)",
  부적: "red",
  저주: "red",
  "결투 선포": "red",
  "약점 분석": "red",
  "분홍 리본": "red",
  구더기: "red",
  "차원 균열": "red",
  "방출 전류": "red",

  호흡: "적중 시 효과 위력에 비례한 확률로 치명타 피해를 입힘\n턴 종료 시, 치명타 발동 후 횟수 1 감소",
  신속: "#E3C451",
  보호: "#E3C451",
  충전: "소모 시 특정 스킬의 능력이 상승함. 최대 20까지 얻을 수 있음. 턴 종료 시 1 감소.",
  광신: "#E3C451",

  탄환: "#915C32",

  도발치: "#7C5B2B",
  시술: "#7C5B2B",
  "K사 앰플": "#7C5B2B",

  "E.G.O 자원 획득량+": "에고",

  "더하기 코인 강화": "#E3C451",
  "더하기 코인 약화": "red",

  "공격 위력 증가": "#E3C451",
  "공격 위력 감소": "red",
  "수비 위력 증가": "#E3C451",
  "수비 위력 감소": "한 턴 동안 수비 스킬의 최종 위력이 수치만큼 감소",
  "공격 레벨 증가": "#E3C451",
  "공격 레벨 감소": "red",
  "방어 레벨 증가": "#E3C451",
  "방어 레벨 감소": "한 턴 동안 방어 레벨이 수치에 비례하여 감소",
  "피해량 증가":
    "한 턴 동안 스킬로 가하는 피해가 수치에 비례하여 증가(최대 10)",
  "피해량 감소": "red",

  "정신력 회복 효율": "#7C5B2B",
  "정신력 감소 효율": "#7C5B2B",

  "체력 회복 감소": "red",

  "참격 취약":
    "한 턴 동안 참격 스킬로 받는 피해가 수치에 비례하여 증가(최대 10)",
  "관통 취약":
    "한 턴 동안 관통 스킬로 받는 피해가 수치에 비례하여 증가(최대 10)",
  "타격 취약":
    "한 턴 동안 타격 스킬로 받는 피해가 수치에 비례하여 증가(최대 10)",
  "참격 보호":
    "한 턴 동안 참격 속성 스킬로 받는 피해가 수치에 비례하여 감소(최대 10)",
  "관통 보호":
    "한 턴 동안 관통 속성 스킬로 받는 피해가 수치에 비례하여 감소(최대 10)",
  "타격 보호":
    "한 턴 동안 타격 속성 스킬로 받는 피해가 수치에 비례하여 감소(최대 10)",
  "참격 피해량 증가": "#E3C451",
  "관통 피해량 증가": "#E3C451",
  "타격 피해량 증가": "#E3C451",
  "참격 피해량 감소": "#E3C451",
  "관통 피해량 감소": "#E3C451",
  "타격 피해량 감소": "#E3C451",

  "분노 취약":
    "한 턴 동안 분노 속성 스킬로 받는 피해가 수치에 비례하여 증가(최대 10)",
  "색욕 취약":
    "한 턴 동안 색욕 속성 스킬로 받는 피해가 수치에 비례하여 증가(최대 10)",
  "나태 취약":
    "한 턴 동안 나태 속성 스킬로 받는 피해가 수치에 비례하여 증가(최대 10)",
  "탐식 취약":
    "한 턴 동안 탐식 속성 스킬로 받는 피해가 수치에 비례하여 증가(최대 10)",
  "우울 취약":
    "한 턴 동안 우울 속성 스킬로 받는 피해가 수치에 비례하여 증가(최대 10)",
  "오만 취약":
    "한 턴 동안 오만 속성 스킬로 받는 피해가 수치에 비례하여 증가(최대 10)",
  "질투 취약":
    "한 턴 동안 질투 속성 스킬로 받는 피해가 수치에 비례하여 증가(최대 10)",
  "분노 보호":
    "한 턴 동안 분노 속성 스킬로 받는 피해가 수치에 비례하여 감소(최대 10)",
  "색욕 보호":
    "한 턴 동안 색욕 속성 스킬로 받는 피해가 수치에 비례하여 감소(최대 10)",
  "나태 보호":
    "한 턴 동안 나태 속성 스킬로 받는 피해가 수치에 비례하여 감소(최대 10)",
  "탐식 보호":
    "한 턴 동안 탐식 속성 스킬로 받는 피해가 수치에 비례하여 감소(최대 10)",
  "우울 보호":
    "한 턴 동안 우울 속성 스킬로 받는 피해가 수치에 비례하여 감소(최대 10)",
  "오만 보호":
    "한 턴 동안 오만 속성 스킬로 받는 피해가 수치에 비례하여 감소(최대 10)",
  "질투 보호":
    "한 턴 동안 질투 속성 스킬로 받는 피해가 수치에 비례하여 감소(최대 10)",
  "분노 피해량 증가":
    "한 턴 동안 분노 속성 스킬로 가하는 피해가 수치에 비례하여 증가(최대 10)",
  "색욕 피해량 증가":
    "한 턴 동안 색욕 속성 스킬로 가하는 피해가 수치에 비례하여 증가(최대 10)",
  "나태 피해량 증가":
    "한 턴 동안 나태 속성 스킬로 가하는 피해가 수치에 비례하여 증가(최대 10)",
  "탐식 피해량 증가":
    "한 턴 동안 탐식 속성 스킬로 가하는 피해가 수치에 비례하여 증가(최대 10)",
  "우울 피해량 증가":
    "한 턴 동안 우울 속성 스킬로 가하는 피해가 수치에 비례하여 증가(최대 10)",
  "오만 피해량 증가":
    "한 턴 동안 오만 속성 스킬로 가하는 피해가 수치에 비례하여 증가(최대 10)",
  "질투 피해량 증가":
    "한 턴 동안 질투 속성 스킬로 가하는 피해가 수치에 비례하여 증가(최대 10)",
};
